app/controllers/posts_controller.rb

  def watch
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
	  title = params[:title]
	  content = params[:content]

	Post.create(title: title, content: content)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Merry Christmas!"], ["content", "테스트 문자!\r\n메리 크리스마스!"], ["created_at", "2022-12-03 13:48:56.506397"], ["updated_at", "2022-12-03 13:48:56.506397"]]